# Pandas utility function

Pandas has utility function to identify and detect null values

In [1]:
import pandas as pd
import numpy as np

In [3]:
pd.isnull(np.nan)

True

In [4]:
pd.isnull(None)

True

In [5]:
pd.isna(np.nan)

True

In [6]:
pd.isna(None)

True

The opposite ones also exist:

In [7]:
pd.notnull(None)

False

In [8]:
pd.notnull(np.nan)

False

In [9]:
pd.notnull(3)

True

These functions also works with series and dataframes:

In [12]:
pd.isnull(pd.Series([1, np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [13]:
pd.notnull(pd.Series([1, np.nan, 7]))

0     True
1    False
2     True
dtype: bool

In [16]:
pd.isnull(pd.DataFrame({
    'Column A': [1, np.nan, 5],
    'Column B': [8, 56, np.nan]
}))

   Column A  Column B
0     False     False
1      True     False
2     False      True

In [17]:
pd.notnull(pd.DataFrame({
    'Column A': [1, np.nan, 5],
    'Column B': [8, 56, np.nan]
}))

   Column A  Column B
0      True      True
1     False      True
2      True     False

# Pandas operation with missing values

In operations with pandas library nan are ignored

In [25]:
pd.Series([1, np.nan, 7]).sum()

8.0

In [26]:
pd.Series([1, np.nan, 7]).mean()

4.0

In [27]:
pd.Series([1, np.nan, 7]).count()

2

# Filtering missing data

Combine boolean selection + pd.isnull to filter out nan or null values:

In [32]:
s= pd.Series([1, 2 , 3 , np.nan, np.nan, 4])

In [33]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [34]:
pd.notnull(s).sum()

4

In [35]:
pd.isnull(s).sum()

2

In [36]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

both isnull and notnull are methods of series and data frames.

In [37]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [38]:
s.notnull()

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [39]:
s[s.notnull()]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

# Dropping null values

In [40]:
s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

Dropping null values on dataframes

In [53]:
df =pd.DataFrame({
    'Column A': [1, np.nan, 5],
    'Column B': [8, 56, np.nan], 
    'Column C': [8, 9, 4]
})

In [54]:
df

   Column A  Column B  Column C
0       1.0       8.0         8
1       NaN      56.0         9
2       5.0       NaN         4

In [55]:
df.shape

(3, 3)

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column A  2 non-null      float64
 1   Column B  2 non-null      float64
 2   Column C  3 non-null      int64
dtypes: float64(2), int64(1)
memory usage: 200.0 bytes

In [57]:
df.isnull()

   Column A  Column B  Column C
0     False     False     False
1      True     False     False
2     False      True     False

In [58]:
df.notnull()

   Column A  Column B  Column C
0      True      True      True
1     False      True      True
2      True     False      True

In [59]:
df.isnull().sum()

Column A    1
Column B    1
Column C    0
dtype: int64

In [60]:
df.dropna()            #default dropna will drop all the rows in which any null values is present
#in this case we are dropping rows that contain any null values, to drop column we should use axis =1

   Column A  Column B  Column C
0       1.0       8.0         8

In [61]:
df

   Column A  Column B  Column C
0       1.0       8.0         8
1       NaN      56.0         9
2       5.0       NaN         4

Above all functions are immutable these donot affect underlying dataframe

In [62]:
df.dropna(axis=1)              # all the columns any containing null values are dropped

   Column C
0         8
1         9
2         4

Control this behaviour by passing parameter 'how' which can be any or all

In [63]:
df

   Column A  Column B  Column C
0       1.0       8.0         8
1       NaN      56.0         9
2       5.0       NaN         4

In [65]:
df.dropna(how= 'any')   #default parameter

   Column A  Column B  Column C
0       1.0       8.0         8

In [66]:
df.dropna(how= 'all')

   Column A  Column B  Column C
0       1.0       8.0         8
1       NaN      56.0         9
2       5.0       NaN         4

we can use thresh parameter to indicate a threshold of not nullvalues for rows/columns to be kept

In [67]:
df.dropna(thresh= 3)

   Column A  Column B  Column C
0       1.0       8.0         8

In [68]:
df.dropna(thresh= 3, axis = 1)

   Column C
0         8
1         9
2         4

# Filling null values

In [69]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

Filling null values with arbitrary values

In [70]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [71]:
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

In [72]:
s        #above methods are not altering the series

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

Filling null values with contiguous(close) values

In [73]:
s.fillna(method='bfill')            #backward fill

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

In [76]:
s.fillna(method= 'ffill')            #forward fill

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [77]:
#This method can still leave the null values at extremes of the series
pd.Series([np.nan, 3, np.nan, 50]).fillna(method='ffill')

0     NaN
1     3.0
2     3.0
3    50.0
dtype: float64

In [79]:
pd.Series([1, 3, np.nan, 50, np.nan]).fillna(method='bfill')

0     1.0
1     3.0
2    50.0
3    50.0
4     NaN
dtype: float64

In [80]:
#Filling null values in data frames
df

   Column A  Column B  Column C
0       1.0       8.0         8
1       NaN      56.0         9
2       5.0       NaN         4

In [85]:
df.fillna({'Column A': 0, 'Column B': df['Column B'].mean()})

   Column A  Column B  Column C
0       1.0       8.0         8
1       0.0      56.0         9
2       5.0      32.0         4

In [86]:
df

   Column A  Column B  Column C
0       1.0       8.0         8
1       NaN      56.0         9
2       5.0       NaN         4

In [87]:
df.fillna(method= 'ffill', axis =0)

   Column A  Column B  Column C
0       1.0       8.0         8
1       1.0      56.0         9
2       5.0      56.0         4

# Checking if there are null values

In [88]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

if there are null values then s.dropna() will have less values than s

In [89]:
s.dropna().count()

4

In [90]:
s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [91]:
missing_values= len(s.dropna())!= len(s)

In [92]:
missing_values

True

In [93]:
#another method, count excludes nan from its result
s.count()

4

In [94]:
len(s)

6

In [96]:
missing_value= s.count()!= len(s)

In [97]:
missing_value

True